# RevisionCloudRevision Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RevisionCloudRevision Property
ParameterTypeId Class See Also
---
"Revision"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RevisionCloudRevision { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RevisionCloudRevision As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RevisionCloudRevision {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace